000100890807     H*
000200890802     H********************************************************************
000300970318     H** PROGRAM NAME: DEMOSRV2                                          *
000400890802     H**                                                                 *
000500890802     H********************************************************************
000600890802     H*
000700890802     D*
000800890802     D                 DS
000900890802     D  CNT                    1      2  0
001000890802     D  SW0                    3      3
001100890802     D  WRKCNT                18     19  0
001200890802     I*
001300890802     C*
001400890802     C     *ENTRY        PLIST
001500890802     C                   PARM                    PARM1            10
001600890808     C                   PARM                    PARM2             4
001700890807     C*
001800890808     C     PARM2         IFGT      *ZERO
001900890808     C                   MOVEL     'ERROR'       PARM1
002000890808     C                   ELSE
002100890808     C                   MOVEL     'CORRECT'     PARM1
002200890808     C                   END
002300890802     C                   RETURN
