000100001027     FMASTERL1  If   E             DISK
000200001027     C                   READ      MASTERL1                               99
000300001027     C                   MOVE      '1'           *INLR
000400170526     H* This is a comment
