000100950110       IDENTIFICATION DIVISION.
000300950110       PROGRAM-ID.  COMMIO.
000700950110       ENVIRONMENT DIVISION.
001400950110       INPUT-OUTPUT SECTION.
001600950110       FILE-CONTROL.
001700950110           SELECT GENLGR
001800950110                  ASSIGN TO FORMATFILE-ACTGLP.
002000950110       DATA DIVISION.
002200950110       FILE SECTION.
002400950110       FD  GENLGR
002500950110           LABEL RECORDS ARE OMITTED.
002700950110       01  ACTGLP-RCD.
002701950110           COPY DDS-ACTGLP OF ACTGLP.
002900950110       LINKAGE SECTION.
003800950110       01  PARM1               PIC      X(10).
004200950112       PROCEDURE DIVISION USING PARM1.
004201950110       PARA-1.
004500950110           OPEN OUTPUT GENLGR.
005300950110           WRITE ACTGLP-RCD.
005301001027       COPY ARS334CPY.
005400950110           CLOSE GENLGR.
